Public Member Functions | Public Attributes | Friends | List of all members
API_IFCTranslatorIdentifier Struct Reference
Project Operations
IFC Translator Identifier. More...
#include <APIdefs_Automate.h>
 Public Member Functions
API_IFCTranslatorIdentifier (const API_IFCTranslatorIdentifier &that)
API_IFCTranslatorIdentifier (API_IFCTranslatorIdentifier &&that)
 API_IFCTranslatorIdentifier &  | operator= (API_IFCTranslatorIdentifier other)
 void  | Swap (API_IFCTranslatorIdentifier &other)
 Public Attributes
 GSHandle  | innerReference
Internal reference.
 GS::UniString  | name
IFC Translator name.
 Friends
 void  | Swap (API_IFCTranslatorIdentifier &left, API_IFCTranslatorIdentifier &right)
Detailed Description
IFC Translator Identifier.
Since
Archicad 26
Remarks
This structure is used in ACAPI_IFC_GetIFCExportTranslatorsList.